In [1]:
import pandas as pd
import numpy as np
from pandas import Series, DataFrame
import pandas_datareader.data as web

In [2]:
obj = Series([4, 7, -5, 3])

In [3]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [6]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [7]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [9]:
obj2 = Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])

In [10]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [12]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [13]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [14]:
obj2[obj2 > 0]

d    4
b    7
c    3
dtype: int64

In [15]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [16]:
obj3 = pd.Series(sdata)

In [17]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [18]:
states = ['California', 'Ohio', 'Oregon', 'Texas']

In [19]:
obj4 = pd.Series(sdata, index=states)

In [20]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [21]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [22]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [23]:
obj1

NameError: name 'obj1' is not defined

In [24]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [25]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [26]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [27]:
obj4.name = 'population'

In [28]:
obj4.index.name = 'state'

In [29]:
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [30]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [31]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']

In [32]:
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

In [3]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [4]:
frame = pd.DataFrame(data)

In [5]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [20]:
pd.DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [5]:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'], index=['one', 'two', 'three', 'four', 'five', 'six'])

In [9]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [10]:
frame2.state

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [11]:
frame2['year']

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [12]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [6]:
frame2.state.one

'Ohio'

In [14]:
i = 'state'

In [21]:
frame2.i

AttributeError: 'DataFrame' object has no attribute 'i'

In [7]:
frame2[i]

NameError: name 'i' is not defined

In [19]:
frame2[i]['one']

'Ohio'

In [22]:
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [8]:
frame2['debt']= 16.5

In [24]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

In [9]:
import numpy as np
frame2['debt'] = np.arange(6.)

In [27]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [28]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [10]:
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])

In [11]:
frame2['debt'] = val

In [12]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [13]:
frame2['eastern'] = frame2.state == 'Ohio'

In [14]:
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [15]:
del frame2['eastern']

In [16]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [17]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [18]:
frame3 = DataFrame(pop)

In [19]:
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [20]:
frame3.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

In [41]:
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [21]:
DataFrame(pop, index=[2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [28]:
import datetime
res = [['id', 'sap_number', 'tms_num', 'sap_status', 'driver_status', 'plan_start_date', 'status', 'sapcode', 'waybillid'], [12238450, '0050329205', '15595238', 'SAP_CHECKED', 'NEW', datetime.datetime(2024, 1, 29, 11, 49), 'READY', 7, 'YG0001139730'], [12240056, '0050344365', '15599044', 'SAP_CHECKED', 'NEW', datetime.datetime(2024, 1, 29, 22, 39, 18), 'READY', 3, 'YG0001139730']]

In [29]:
res

[['id',
  'sap_number',
  'tms_num',
  'sap_status',
  'driver_status',
  'plan_start_date',
  'status',
  'sapcode',
  'waybillid'],
 [12238450,
  '0050329205',
  '15595238',
  'SAP_CHECKED',
  'NEW',
  datetime.datetime(2024, 1, 29, 11, 49),
  'READY',
  7,
  'YG0001139730'],
 [12240056,
  '0050344365',
  '15599044',
  'SAP_CHECKED',
  'NEW',
  datetime.datetime(2024, 1, 29, 22, 39, 18),
  'READY',
  3,
  'YG0001139730']]

In [31]:
DataFrame(res[1:], columns=res[0])

,id,sap_number,tms_num,sap_status,driver_status,plan_start_date,status,sapcode,waybillid
0,12238450,0050329205,15595238,SAP_CHECKED,NEW,2024-01-29 11:49:00,READY,7,YG0001139730
1,12240056,0050344365,15599044,SAP_CHECKED,NEW,2024-01-29 22:39:18,READY,3,YG0001139730

In [32]:
DataFrame(res)

,0,1,2,3,4,5,6,7,8
0,id,sap_number,tms_num,sap_status,driver_status,plan_start_date,status,sapcode,waybillid
1,12238450,0050329205,15595238,SAP_CHECKED,NEW,2024-01-29 11:49:00,READY,7,YG0001139730
2,12240056,0050344365,15599044,SAP_CHECKED,NEW,2024-01-29 22:39:18,READY,3,YG0001139730

In [33]:
pdata = {'Ohio': frame3['Ohio'][:-1],'Nevada': frame3['Nevada'][:2]}

In [34]:
DataFrame(pdata)

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9

In [36]:
obj = Series(range(3), index=['a', 'b', 'c'])

In [37]:
index = obj.index

In [38]:
index

Index(['a', 'b', 'c'], dtype='object')

In [39]:
index[1:]

Index(['b', 'c'], dtype='object')

In [40]:
labels = pd.Index(np.arange(3))

In [41]:
labels

Index([0, 1, 2], dtype='int32')

In [45]:
obj2 = pd.Series([1.5, -2.5, 0], index=labels)

In [46]:
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [47]:
obj2.index is labels

True

In [48]:
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [51]:
frame3.columns

Index(['Nevada', 'Ohio'], dtype='object', name='state')

In [50]:
frame3.index.name = 'year'; frame3.columns.name = 'state'

In [52]:
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7],
       [2003, 'Nevada', 3.2, nan]], dtype=object)

In [53]:
frame3.columns

Index(['Nevada', 'Ohio'], dtype='object', name='state')

In [54]:
'Ohio' in frame3.columns

True

In [55]:
2003 in frame3.index

False

In [56]:
dup_labels = pd.Index(['foo', 'foo', 'bar', 'bar'])

In [57]:
dup_labels

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

In [60]:
obj = Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])

In [61]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])

In [62]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [63]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])

In [64]:
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [65]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),index=['a', 'c', 'd'],columns=['Ohio', 'Texas', 'California'])

In [66]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [67]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])

In [68]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [69]:
states = ['Texas', 'Utah', 'California']

In [70]:
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [85]:
obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])

In [86]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [87]:
new_obj = obj.drop('c')

In [88]:
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [89]:
obj.drop(['d', 'c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [90]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [91]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),index=['Ohio', 'Colorado', 'Utah', 'New York'],columns=['one', 'two', 'three', 'four'])

In [92]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [93]:
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [94]:
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [95]:
data.drop(['two', 'four'], axis='columns')

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [96]:
DataFrame.loc -?

SyntaxError: invalid syntax (2941873215.py, line 1)

In [97]:
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])

In [98]:
obj['b']

1.0

In [99]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [100]:
obj[1]

C:\Users\anton.dmitriev\AppData\Local\Temp\ipykernel_13804\2469632899.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  obj[1]

1.0

In [101]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [102]:
obj[2]

C:\Users\anton.dmitriev\AppData\Local\Temp\ipykernel_13804\1027971403.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  obj[2]

2.0

In [103]:
obj[['b', 'a', 'd']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [104]:
obj[[1, 3]]

C:\Users\anton.dmitriev\AppData\Local\Temp\ipykernel_13804\2982346117.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  obj[[1, 3]]

b    1.0
d    3.0
dtype: float64

In [105]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [106]:
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [107]:
obj['b':'c'] = 5

In [108]:
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [109]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),index=['Ohio', 'Colorado', 'Utah', 'New York'],columns=['one', 'two', 'three', 'four'])

In [110]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [111]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [112]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [114]:
data.T['Utah']

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [115]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [116]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [117]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [118]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [119]:
data[data < 5] = 0

In [120]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [121]:
data.loc['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int32

In [122]:
data.iloc[2, [3, 0, 1]]

four    11
one      8
two      9
Name: Utah, dtype: int32

In [123]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [124]:
data.iloc[[1, 2], [3, 0, 1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [125]:
data.loc[:'Utah', 'two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [128]:
data.iloc[:, :2]

          one  two
Ohio        0    0
Colorado    0    5
Utah        8    9
New York   12   13

In [127]:
data.iloc[:, :3][data.three > 5]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

In [129]:
ser = pd.Series(np.arange(3.))

In [131]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [132]:
ser2 = pd.Series(np.arange(3.), index=['a', 'b', 'c'])

In [133]:
ser[-1]

KeyError: -1

In [134]:
ser2[-1]

C:\Users\anton.dmitriev\AppData\Local\Temp\ipykernel_13804\811950851.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  ser2[-1]

2.0

In [135]:
ser2.iloc[-1]

2.0

In [136]:
ser[:1]

0    0.0
dtype: float64

In [137]:
ser.iloc[:1]

0    0.0
dtype: float64

In [138]:
ser.loc[:1]

0    0.0
1    1.0
dtype: float64

In [140]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])

In [141]:
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1],index=['a', 'c', 'e', 'f', 'g'])

In [142]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [143]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [144]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [145]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),index=['Ohio', 'Texas', 'Colorado'])

In [146]:
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [147]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [148]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [149]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [150]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)),columns=list('abcd'))

In [151]:
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)),columns=list('abcde'))

In [152]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [153]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [154]:
df2.loc[1, 'b'] = np.nan

In [155]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [156]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [157]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [158]:
1 / df1

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [159]:
df1.rdiv(1)

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [160]:
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

In [161]:
arr = np.arange(12.).reshape((3, 4))

In [162]:
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [163]:
arr[0]

array([0., 1., 2., 3.])

In [164]:
arr – arr[0]

SyntaxError: invalid character '–' (U+2013) (3905017687.py, line 1)

In [2]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),columns=list('bde'),index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [9]:
series = frame.iloc[0]

In [7]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [168]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [11]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [12]:
arr - arr[0]

NameError: name 'arr' is not defined

In [172]:
arr -= arr[0]

In [173]:
arr

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [174]:
arr = np.arange(12.).reshape((3, 4))

In [175]:
arr - arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [176]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [177]:
series2 = pd.Series(range(3), index=['b', 'e', 'f'])

In [178]:
series2

b    0
e    1
f    2
dtype: int64

In [179]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [15]:
series3 = frame['d']

In [181]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [182]:
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [183]:
frame.sub(series3, axis='index')

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

In [184]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [186]:
f = lambda x: x.max() - x.min()

In [187]:
frame.apply(f)

b    9.0
d    9.0
e    9.0
dtype: float64

In [188]:
frame.apply(f, axis='columns')

Utah      2.0
Ohio      2.0
Texas     2.0
Oregon    2.0
dtype: float64

In [189]:
def f(x):
    return Series([x.min(), x.max()], index=['min', 'max'])

In [190]:
frame.apply(f)

       b     d     e
min  0.0   1.0   2.0
max  9.0  10.0  11.0

In [4]:
format = lambda x: '%.2f' % x

In [6]:
frame.applymap(format)

C:\Users\anton.dmitriev\AppData\Local\Temp\ipykernel_22872\304758519.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  frame.applymap(format)

           b      d      e
Utah    0.00   1.00   2.00
Ohio    3.00   4.00   5.00
Texas   6.00   7.00   8.00
Oregon  9.00  10.00  11.00

In [5]:
frame['e'].map(format)

Utah       2.00
Ohio       5.00
Texas      8.00
Oregon    11.00
Name: e, dtype: object

In [13]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [16]:
frame.sub(series3, axis='index')

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

In [17]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [18]:
np.abs(frame)

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [19]:
obj = Series(range(4), index=['d', 'a', 'b', 'c'])

In [20]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [21]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),index=['three', 'one'],columns=['d', 'a', 'b', 'c'])

In [22]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [23]:
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [24]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [25]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [26]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [27]:
obj = pd.Series([4, 7, -3, 2])

In [5]:
obj = Series([4, np.nan, 7, np.nan, -3, 2])

In [6]:
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [8]:
frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})

In [9]:
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [11]:
frame.sort_values(by='b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [13]:
frame.sort_values(by=['a', 'b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [15]:
obj = Series([7, -5, 7, 4, 2, 0, 4])

In [16]:
obj

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [17]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [18]:
obj.rank(ascending=False, method='max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [19]:
frame = pd.DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1],'c': [-2, 5, 8, -2.5]})

In [20]:
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [21]:
frame.rank(axis='columns')

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

In [22]:
obj = Series(range(5), index=['a', 'a', 'b', 'b', 'c'])

In [23]:
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [24]:
obj.index

Index(['a', 'a', 'b', 'b', 'c'], dtype='object')

In [25]:
obj.index.is_unique

False

In [26]:
obj['a']

a    0
a    1
dtype: int64

In [27]:
df = DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])

In [28]:
df

          0         1         2
a -1.127414  0.531271  0.757747
a  0.121493  0.234834  0.929120
b -0.514562 -1.987216  0.680200
b  0.624672  0.499381 -0.955692

In [31]:
df.loc['b']

          0         1         2
b -0.514562 -1.987216  0.680200
b  0.624672  0.499381 -0.955692

In [32]:
df = DataFrame([[1.4, np.nan], [7.1, -4.5],[np.nan, np.nan], [0.75, -1.3]],index=['a', 'b', 'c', 'd'],columns=['one', 'two'])

In [33]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [34]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [37]:
df.sum(axis=1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [38]:
df.mean(axis=1, skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [39]:
df.idxmax()

one    b
two    d
dtype: object

In [40]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [41]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [42]:
obj = Series(['a', 'a', 'b', 'c'] * 4)

In [43]:
obj

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

In [44]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

In [4]:
all_data = {ticker: web.get_data_yahoo(ticker)
for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']}
price = pd.DataFrame({ticker: data['Adj Close']
for ticker, data in all_data.items()})
volume = pd.DataFrame({ticker: data['Volume']
for ticker, data in all_data.items()})

SSLError: HTTPSConnectionPool(host='finance.yahoo.com', port=443): Max retries exceeded with url: /quote/AAPL/history?period1=1549843200&period2=1707609599&interval=1d&frequency=1d&filter=history (Caused by SSLError(SSLCertVerificationError(1, '[SSL: CERTIFICATE_VERIFY_FAILED] certificate verify failed: unable to get local issuer certificate (_ssl.c:1000)')))

In [14]:
df = web.DataReader('SBER', 'moex', start='2024-01-01', end='2024-02-10')

SSLError: HTTPSConnectionPool(host='iss.moex.com', port=443): Max retries exceeded with url: /iss/securities/SBER.csv (Caused by SSLError(SSLCertVerificationError(1, '[SSL: CERTIFICATE_VERIFY_FAILED] certificate verify failed: unable to get local issuer certificate (_ssl.c:1000)')))

In [7]:
import requests

In [12]:
import certifi
import datetime

In [9]:
print(certifi.where())

C:\Users\anton.dmitriev\PycharmProjects\data_analysis\venv\Lib\site-packages\certifi\cacert.pem

In [33]:
start = datetime.datetime.now - timedelta(days = 2)
end = datetime.datetime.now()
session = requests.Session()
session.verify = False

NameError: name 'timedelta' is not defined

In [30]:
df = web.DataReader('SBER', start, end, session=session)

NotImplementedError: data_source=datetime.datetime(2024, 1, 1, 0, 0) is not implemented

In [19]:
df

NameError: name 'df' is not defined

In [25]:
print(start)

2023-01-01 00:00:00

In [27]:
start

datetime.datetime(2023, 1, 1, 0, 0)

In [2]:
obj = Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

In [3]:
uniques = obj.unique()

In [4]:
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [5]:
obj.value_counts()

c    3
a    3
b    2
d    1
Name: count, dtype: int64

In [6]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [7]:
mask = obj.isin(['b', 'c'])

In [8]:
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [9]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [10]:
to_match = pd.Series(['c', 'a', 'b', 'b', 'c', 'a'])

In [11]:
unique_vals = pd.Series(['c', 'b', 'a'])

In [12]:
pd.Index(unique_vals).get_indexer(to_match)

array([0, 2, 1, 1, 0, 2], dtype=int64)

In [13]:
data = DataFrame({'Qu1': [1, 3, 4, 3, 4],'Qu2': [2, 3, 1, 2, 3],'Qu3': [1, 5, 2, 4, 4]})

In [14]:
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [15]:
result = data.apply(pd.value_counts).fillna(0)

C:\Users\anton.dmitriev\AppData\Local\Temp\ipykernel_20804\2451317050.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  result = data.apply(pd.value_counts).fillna(0)

In [16]:
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [18]:
!cat ex1.csv

"cat" ­Ґ пў«пҐвбп ў­гваҐ­­Ґ© Ё«Ё ў­Ґи­Ґ©
Є®¬ ­¤®©, ЁбЇ®«­пҐ¬®© Їа®Ја ¬¬®© Ё«Ё Ї ЄҐв­л¬ д ©«®¬.

In [21]:
df = pd.read_csv('examples/ex1.csv')

In [22]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [23]:
pd.read_table('examples/ex1.csv', sep=',')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [24]:
!cat examples/ex2.csv

"cat" ­Ґ пў«пҐвбп ў­гваҐ­­Ґ© Ё«Ё ў­Ґи­Ґ©
Є®¬ ­¤®©, ЁбЇ®«­пҐ¬®© Їа®Ја ¬¬®© Ё«Ё Ї ЄҐв­л¬ д ©«®¬.

In [25]:
pd.read_csv('examples/ex2.csv', header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [26]:
pd.read_csv('examples/ex2.csv', names=['a', 'b', 'c', 'd', 'message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [27]:
names = ['a', 'b', 'c', 'd', 'message']

In [28]:
pd.read_csv('examples/ex2.csv', names=names, index_col='message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [29]:
parsed = pd.read_csv('examples/csv_mindex.csv',index_col=['key1', 'key2'])

In [30]:
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [33]:
pd.read_table('examples/ex3.txt, sep='\s+')

SyntaxError: unexpected character after line continuation character (2907493832.py, line 1)

In [34]:
pd.read_table('examples/ex3.txt', sep='\s+')

<>:1: SyntaxWarning: invalid escape sequence '\s'
<>:1: SyntaxWarning: invalid escape sequence '\s'
C:\Users\anton.dmitriev\AppData\Local\Temp\ipykernel_20804\3158315007.py:1: SyntaxWarning: invalid escape sequence '\s'
  pd.read_table('examples/ex3.txt', sep='\s+')

             A          B          C
aaa  –0.264438  –1.026059  –0.619500
bbb   0.927272   0.302904  –0.032399
ccc  –0.264273  –0.386314  –0.217601
ddd  –0.871858  –0.348382   1.100491

In [35]:
pd.read_csv('examples/ex4.csv', skiprows=[0, 2, 3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [36]:
result = pd.read_csv('examples/ex5.csv')

In [37]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [38]:
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [39]:
result = pd.read_csv('examples/ex5.csv', na_values=['NULL'])

In [40]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [41]:
sentinels = {'message': ['foo', 'NA'], 'something': ['two']}

In [42]:
pd.read_csv('examples/ex5.csv', na_values=sentinels)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

In [3]:
data = pd.read_csv('examples/ex5.csv')

In [4]:
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [46]:
data.to_csv('examples/out.csv')

In [2]:
import sys

In [48]:
data.to_csv(sys.stdout, sep='|')

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [49]:
data.to_csv(sys.stdout, na_rep='NULL')

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [50]:
data.to_csv(sys.stdout, index=False, header=False)

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [6]:
data.to_csv(sys.stdout, index=False, columns=['a', 'b', 'c'])

a,b,c
1,2,3.0
5,6,
9,10,11.0

In [7]:
dates = pd.date_range('1/1/2000', periods=7)

In [8]:
dates

DatetimeIndex(['2000-01-01', '2000-01-02', '2000-01-03', '2000-01-04',
               '2000-01-05', '2000-01-06', '2000-01-07'],
              dtype='datetime64[ns]', freq='D')

In [9]:
ts = Series(np.arange(7), index=dates)

In [10]:
ts.to_csv('examples/tseries.csv')

In [11]:
!?

"?" ­Ґ пў«пҐвбп ў­гваҐ­­Ґ© Ё«Ё ў­Ґи­Ґ©
Є®¬ ­¤®©, ЁбЇ®«­пҐ¬®© Їа®Ја ¬¬®© Ё«Ё Ї ЄҐв­л¬ д ©«®¬.

In [13]:
!type examples/tseries.csv

ЋиЁЎЄ  ў бЁ­в ЄбЁбҐ Є®¬ ­¤л.

In [14]:
!type examples/ex1.csv

ЋиЁЎЄ  ў бЁ­в ЄбЁбҐ Є®¬ ­¤л.

In [15]:
pd.read_csv('examples/tseries.csv')

   Unnamed: 0  0
0  2000-01-01  0
1  2000-01-02  1
2  2000-01-03  2
3  2000-01-04  3
4  2000-01-05  4
5  2000-01-06  5
6  2000-01-07  6

In [16]:
import csv

In [17]:
f = open('examples/ex7.csv')

In [18]:
reader = csv.reader(f)

In [19]:
reader

In [21]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3', '4']

In [24]:
with open('examples/ex7.csv') as f:
    lines = list(csv.reader(f))

In [25]:
header, values = lines[0], lines[1:]

In [26]:
data_dict = {h: v for h, v in zip(header, zip(*values))}

In [27]:
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [28]:
obj = """
{"name": "Wes",
"places_lived": ["United States", "Spain", "Germany"],
"pet": null,
"siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
{"name": "Katie", "age": 38,
"pets": ["Sixes", "Stache", "Cisco"]}]
}
"""

In [29]:
import json

In [30]:
result = json.loads(obj)

In [31]:
result

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [32]:
asjson = json.dumps(result)

In [33]:
siblings = DataFrame(result['siblings'], columns=['name', 'age'])

In [34]:
siblings

    name  age
0  Scott   30
1  Katie   38

In [35]:
data = pd.read_json('examples/example.json')

In [36]:
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [37]:
frame = pd.read_csv('examples/ex1.csv')

In [38]:
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [ ]:
frame.save('examples/frame_pickle')

In [4]:
xlsx = pd.ExcelFile('examples/ex1.xlsx')

In [6]:
pd.read_excel(xlsx, 'Лист1')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [7]:
frame = pd.read_excel('examples/ex1.xlsx', 'Лист1')

In [8]:
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [9]:
writer = pd.ExcelWriter('examples/ex2.xlsx')

In [10]:
frame.to_excel(writer, 'Sheet1')

In [12]:
writer.close()

In [13]:
import requests

In [14]:
url = 'https://api.github.com/repos/pandas–dev/pandas/issues'

In [1]:
import sqlite3

In [2]:
query = """CREATE TABLE test (a VARCHAR(20), b VARCHAR(20),c REAL, d INTEGER);"""

In [3]:
con = sqlite3.connect('mydata.sqlite')

In [4]:
con.execute(query)

In [5]:
con.commit()

In [6]:
data = [('Atlanta', 'Georgia', 1.25, 6),
        ('Tallahassee', 'Florida', 2.6, 3),
        ('Sacramento', 'California', 1.7, 5)]

In [7]:
stmt = "INSERT INTO test VALUES(?, ?, ?, ?)"

In [8]:
con.executemany(stmt, data)

In [9]:
con.commit()

In [10]:
cursor = con.execute('select * from test')

In [11]:
rows = cursor.fetchall()

In [12]:
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [13]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [34]:
DataFrame(rows, columns=[c[0] for c in cursor.description])

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

In [32]:
[c[0] for c in cursor.description]

['a', 'b', 'c', 'd']

In [37]:
import sqlalchemy as sqla

In [38]:
db = sqla.create_engine('sqlite:///mydata.sqlite')

In [39]:
pd.read_sql('select * from test', db)

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

In [40]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])

In [41]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [42]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [43]:
string_data[0] = None

In [44]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [45]:
from numpy import nan as NA

In [46]:
data = Series([1, NA, 3.5, NA, 7])

In [47]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [48]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [50]:
data = DataFrame([[1., 6.5, 3.], [1., NA, NA],
                  [NA, NA, NA], [NA, 6.5, 3.]])

In [51]:
cleaned = data.dropna()

In [52]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [53]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [54]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [55]:
data[4] = NA

In [56]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [57]:
df = pd.DataFrame(np.random.randn(7, 3))

In [58]:
df.iloc[:4, 1] = NA

In [59]:
df

          0         1         2
0  0.306730       NaN -0.587517
1 -2.445101       NaN -1.127164
2 -1.541153       NaN  1.153118
3 -0.926929       NaN  1.592240
4  0.794417 -0.311858 -0.195105
5 -2.266700  0.317396  0.134709
6  0.597696 -0.334146  0.252845

In [60]:
df.iloc[:2, 2] = NA

In [61]:
df

          0         1         2
0  0.306730       NaN       NaN
1 -2.445101       NaN       NaN
2 -1.541153       NaN  1.153118
3 -0.926929       NaN  1.592240
4  0.794417 -0.311858 -0.195105
5 -2.266700  0.317396  0.134709
6  0.597696 -0.334146  0.252845

In [62]:
df.dropna(thresh=2)

          0         1         2
2 -1.541153       NaN  1.153118
3 -0.926929       NaN  1.592240
4  0.794417 -0.311858 -0.195105
5 -2.266700  0.317396  0.134709
6  0.597696 -0.334146  0.252845

In [63]:
df.fillna(0)

          0         1         2
0  0.306730  0.000000  0.000000
1 -2.445101  0.000000  0.000000
2 -1.541153  0.000000  1.153118
3 -0.926929  0.000000  1.592240
4  0.794417 -0.311858 -0.195105
5 -2.266700  0.317396  0.134709
6  0.597696 -0.334146  0.252845

In [64]:
df

          0         1         2
0  0.306730       NaN       NaN
1 -2.445101       NaN       NaN
2 -1.541153       NaN  1.153118
3 -0.926929       NaN  1.592240
4  0.794417 -0.311858 -0.195105
5 -2.266700  0.317396  0.134709
6  0.597696 -0.334146  0.252845

In [65]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0  0.306730  0.500000  0.000000
1 -2.445101  0.500000  0.000000
2 -1.541153  0.500000  1.153118
3 -0.926929  0.500000  1.592240
4  0.794417 -0.311858 -0.195105
5 -2.266700  0.317396  0.134709
6  0.597696 -0.334146  0.252845

In [66]:
_ = df.fillna(0, inplace=True)

In [67]:
df

          0         1         2
0  0.306730  0.000000  0.000000
1 -2.445101  0.000000  0.000000
2 -1.541153  0.000000  1.153118
3 -0.926929  0.000000  1.592240
4  0.794417 -0.311858 -0.195105
5 -2.266700  0.317396  0.134709
6  0.597696 -0.334146  0.252845

In [68]:
df = pd.DataFrame(np.random.randn(6, 3))

In [69]:
df.iloc[2:, 1] = NA

In [70]:
df.iloc[4:, 2] = NA

In [71]:
df

          0         1         2
0  1.272378  1.207244  0.040614
1 -0.812193  0.260243 -0.386242
2 -2.394771       NaN -0.933832
3 -0.139331       NaN  0.137129
4 -0.602029       NaN       NaN
5 -0.388353       NaN       NaN

In [72]:
df.fillna(method='ffill')

C:\Users\anton.dmitriev\AppData\Local\Temp\ipykernel_21076\1193302488.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='ffill')

          0         1         2
0  1.272378  1.207244  0.040614
1 -0.812193  0.260243 -0.386242
2 -2.394771  0.260243 -0.933832
3 -0.139331  0.260243  0.137129
4 -0.602029  0.260243  0.137129
5 -0.388353  0.260243  0.137129

In [73]:
df.fillna(method='ffill', limit=2)

C:\Users\anton.dmitriev\AppData\Local\Temp\ipykernel_21076\2719175769.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='ffill', limit=2)

          0         1         2
0  1.272378  1.207244  0.040614
1 -0.812193  0.260243 -0.386242
2 -2.394771  0.260243 -0.933832
3 -0.139331  0.260243  0.137129
4 -0.602029       NaN  0.137129
5 -0.388353       NaN  0.137129

In [74]:
data = Series([1., NA, 3.5, NA, 7])

In [75]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [76]:
data = DataFrame({'k1': ['one'] * 3 + ['two'] * 4,
                  'k2': [1, 1, 2, 3, 3, 4, 4]})

In [77]:
data

    k1  k2
0  one   1
1  one   1
2  one   2
3  two   3
4  two   3
5  two   4
6  two   4

In [78]:
data.duplicated()

0    False
1     True
2    False
3    False
4     True
5    False
6     True
dtype: bool

In [79]:
data.drop_duplicates()

    k1  k2
0  one   1
2  one   2
3  two   3
5  two   4

In [80]:
data['v1'] = range(7)

In [81]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
3  two   3   3

In [82]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
1  one   1   1
2  one   2   2
4  two   3   4
6  two   4   6

In [3]:
data = DataFrame({'food': ['bacon', 'pulled pork', 'bacon', 'Pastrami',
                           'corned beef', 'Bacon', 'pastrami', 'honey ham',
                           'nova lox'],
                  'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [4]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [5]:
meat_to_animal = {
'bacon' : 'pig',
'pulled pork': 'pig',
'pastrami': 'cow',
'corned beef': 'cow',
'honey ham': 'pig',
'nova lox': 'salmon'
}

In [6]:
lowercased = data['food'].str.lower()

In [7]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [8]:
data['animal'] = lowercased.map(meat_to_animal)

In [9]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [10]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [11]:
data = Series([1., -999., 2., -999., -1000., 3.])

In [12]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [14]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [15]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [17]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [19]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [20]:
data = DataFrame(np.arange(12).reshape((3, 4)),
                 index=['Ohio', 'Colorado', 'New York'],
                 columns=['one', 'two', 'three', 'four'])

In [21]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [22]:
transform = lambda x: x[:4].upper()

In [23]:
transform

In [24]:
data.index.map(str.upper)

Index(['OHIO', 'COLORADO', 'NEW YORK'], dtype='object')

In [25]:
data.index = data.index.map(transform)

In [26]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [27]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [28]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [29]:
bins = [18, 25, 35, 60, 100]

In [30]:
cats = pd.cut(ages, bins)

In [31]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [32]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [33]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]], dtype='interval[int64, right]')

In [34]:
pd.value_counts(cats)

C:\Users\anton.dmitriev\AppData\Local\Temp\ipykernel_20332\1485279302.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(cats)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
Name: count, dtype: int64

In [35]:
cats.value_counts()

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
Name: count, dtype: int64

In [36]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64, left]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [37]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']

In [38]:
pd.cut(ages, bins, labels=group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [39]:
data = np.random.rand(20)

In [40]:
data

array([0.24294625, 0.97896181, 0.60351393, 0.0058634 , 0.32293859,
       0.66106266, 0.74489108, 0.57012385, 0.89775474, 0.09748917,
       0.8286753 , 0.31077733, 0.46200931, 0.29234226, 0.11579172,
       0.97097995, 0.82520119, 0.91271359, 0.19607541, 0.10167581])

In [41]:
pd.cut(data, 4, precision=2)

[(0.0049, 0.25], (0.74, 0.98], (0.49, 0.74], (0.0049, 0.25], (0.25, 0.49], ..., (0.74, 0.98], (0.74, 0.98], (0.74, 0.98], (0.0049, 0.25], (0.0049, 0.25]]
Length: 20
Categories (4, interval[float64, right]): [(0.0049, 0.25] < (0.25, 0.49] < (0.49, 0.74] < (0.74, 0.98]]

In [42]:
data = np.random.randn(1000)

In [43]:
cats = pd.qcut(data, 4) # разложить по квартилям

In [44]:
cats

[(0.644, 2.655], (-0.0151, 0.644], (-0.673, -0.0151], (0.644, 2.655], (0.644, 2.655], ..., (0.644, 2.655], (-0.0151, 0.644], (-0.673, -0.0151], (-0.673, -0.0151], (-3.788, -0.673]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.788, -0.673] < (-0.673, -0.0151] < (-0.0151, 0.644] < (0.644, 2.655]]

In [45]:
cats.value_counts()

(-3.788, -0.673]     250
(-0.673, -0.0151]    250
(-0.0151, 0.644]     250
(0.644, 2.655]       250
Name: count, dtype: int64

In [46]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(1.235, 2.655], (-0.0151, 1.235], (-1.325, -0.0151], (1.235, 2.655], (-0.0151, 1.235], ..., (1.235, 2.655], (-0.0151, 1.235], (-1.325, -0.0151], (-1.325, -0.0151], (-1.325, -0.0151]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.788, -1.325] < (-1.325, -0.0151] < (-0.0151, 1.235] < (1.235, 2.655]]

In [2]:
data = pd.DataFrame(np.random.randn(1000, 4))

In [3]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.059261     0.013063    -0.014205    -0.049006
std       1.012041     0.997823     1.015858     0.991541
min      -3.626050    -3.357515    -2.728092    -3.315398
25%      -0.605974    -0.648717    -0.680032    -0.700257
50%       0.099120     0.042987    -0.037742    -0.013949
75%       0.715066     0.694381     0.665833     0.623203
max       2.928907     2.770982     3.078140     3.546159

In [4]:
data

            0         1         2         3
0   -0.596557  0.065963 -0.267854  0.623010
1    0.926954 -0.012735  1.564694 -0.208945
2    0.749114  0.355114 -0.146896 -0.806995
3    1.501566  1.155179 -0.603815  0.142771
4    0.500958  0.684051  1.642917 -0.343937
..        ...       ...       ...       ...
995  0.032748  1.009615 -0.245603  0.697891
996  2.157966  1.741589 -0.907953 -1.520001
997 -0.472708  0.956693  0.587879 -0.372294
998  0.165816 -0.246217  0.001051  0.737437
999 -0.645941  0.002178  0.657377  0.687212

[1000 rows x 4 columns]

In [5]:
col = data[2]

In [11]:
col[np.abs(col) > 3]

603    3.023973
674    3.078140
Name: 2, dtype: float64

In [10]:
data[(np.abs(data) > 3).any(1)]

TypeError: DataFrame.any() takes 1 positional argument but 3 were given

In [12]:
data[np.abs(data) > 3] = np.sign(data) * 3

In [13]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.060572     0.014003    -0.014307    -0.048994
std       1.007741     0.994830     1.015552     0.987236
min      -3.000000    -3.000000    -2.728092    -3.000000
25%      -0.605974    -0.648717    -0.680032    -0.700257
50%       0.099120     0.042987    -0.037742    -0.013949
75%       0.715066     0.694381     0.665833     0.623203
max       2.928907     2.770982     3.000000     3.000000

In [14]:
np.sign(data).head()

     0    1    2    3
0 -1.0  1.0 -1.0  1.0
1  1.0 -1.0  1.0 -1.0
2  1.0  1.0 -1.0 -1.0
3  1.0  1.0 -1.0  1.0
4  1.0  1.0  1.0 -1.0

In [15]:
data

            0         1         2         3
0   -0.596557  0.065963 -0.267854  0.623010
1    0.926954 -0.012735  1.564694 -0.208945
2    0.749114  0.355114 -0.146896 -0.806995
3    1.501566  1.155179 -0.603815  0.142771
4    0.500958  0.684051  1.642917 -0.343937
..        ...       ...       ...       ...
995  0.032748  1.009615 -0.245603  0.697891
996  2.157966  1.741589 -0.907953 -1.520001
997 -0.472708  0.956693  0.587879 -0.372294
998  0.165816 -0.246217  0.001051  0.737437
999 -0.645941  0.002178  0.657377  0.687212

[1000 rows x 4 columns]

In [16]:
np.arange(5 * 4)

array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16,
       17, 18, 19])

In [17]:
df = DataFrame(np.arange(5 * 4).reshape(5, 4))

In [18]:
sampler = np.random.permutation(5)

In [19]:
sampler

array([3, 1, 4, 0, 2])

In [20]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [21]:
df.take(sampler)

    0   1   2   3
3  12  13  14  15
1   4   5   6   7
4  16  17  18  19
0   0   1   2   3
2   8   9  10  11

In [22]:
df.sample(n=3)

    0   1   2   3
2   8   9  10  11
1   4   5   6   7
4  16  17  18  19

In [24]:
choices = pd.Series([5, 7, -1, 6, 4])

In [25]:
draws = choices.sample(n=10, replace=True)

In [26]:
draws

0    5
3    6
0    5
0    5
0    5
3    6
2   -1
0    5
1    7
1    7
dtype: int64

In [27]:
df = DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                'data1': range(6)})

In [28]:
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [31]:
pd.get_dummies(df['key'], dtype=int)

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [35]:
dummies = pd.get_dummies(df['key'], prefix='key', dtype=int)

In [36]:
df_with_dummy = df[['data1']].join(dummies)

In [37]:
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [40]:
mnames = ['movie_id', 'title', 'genres']

In [42]:
movies = pd.read_table('datasets/movielens/movies.dat', sep='::',
                       header=None, names=mnames, engine='python')

In [43]:
movies[:10]

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [44]:
all_genres = []

In [46]:
for x in movies.genres:
    all_genres.extend(x.split('|'))

In [47]:
genres = pd.unique(all_genres)

C:\Users\anton.dmitriev\AppData\Local\Temp\ipykernel_12100\1657210076.py:1: FutureWarning: unique with argument that is not not a Series, Index, ExtensionArray, or np.ndarray is deprecated and will raise in a future version.
  genres = pd.unique(all_genres)

In [48]:
genres

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [49]:
zero_matrix = np.zeros((len(movies), len(genres)))

In [50]:
dummies = pd.DataFrame(zero_matrix, columns=genres)

In [52]:
gen = movies.genres[0]

In [53]:
gen.split('|')

['Animation', "Children's", 'Comedy']

In [54]:
dummies.columns.get_indexer(gen.split('|'))

array([0, 1, 2], dtype=int64)

In [55]:
for i, gen in enumerate(movies.genres):
    indices = dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i, indices] = 1

In [56]:
movies_windic = movies.join(dummies.add_prefix('Genre_'))

In [57]:
movies_windic.iloc[0]

movie_id                                       1
title                           Toy Story (1995)
genres               Animation|Children's|Comedy
Genre_Animation                              1.0
Genre_Children's                             1.0
Genre_Comedy                                 1.0
Genre_Adventure                              0.0
Genre_Fantasy                                0.0
Genre_Romance                                0.0
Genre_Drama                                  0.0
Genre_Action                                 0.0
Genre_Crime                                  0.0
Genre_Thriller                               0.0
Genre_Horror                                 0.0
Genre_Sci-Fi                                 0.0
Genre_Documentary                            0.0
Genre_War                                    0.0
Genre_Musical                                0.0
Genre_Mystery                                0.0
Genre_Film-Noir                              0.0
Genre_Western                                0.0
Name: 0, dtype: object

In [59]:
np.random.seed(12345)

In [60]:
values = np.random.rand(10)

In [61]:
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [62]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]

In [64]:
pd.get_dummies(pd.cut(values, bins),dtype=int)

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

In [65]:
val = 'a,b, guido'

In [66]:
val.split(',')

['a', 'b', ' guido']

In [67]:
pieces = [x.strip() for x in val.split(',')]

In [68]:
pieces

['a', 'b', 'guido']

In [69]:
first, second, third = pieces

In [70]:
first + '::' + second + '::' + third

'a::b::guido'

In [71]:
'::'.join(pieces)

'a::b::guido'

In [72]:
val.index(',')

1

In [73]:
val.find(':')

-1

In [76]:
val.index(':')

ValueError: substring not found

In [77]:
val.count(',')

2

In [78]:
val.replace(',', '::')

'a::b:: guido'

In [79]:
val.replace(',', '')

'ab guido'

In [80]:
import re

In [81]:
text = "foo      bar\t baz \tqux"

In [84]:
re.split('\s+', text)

<>:1: SyntaxWarning: invalid escape sequence '\s'
<>:1: SyntaxWarning: invalid escape sequence '\s'
C:\Users\anton.dmitriev\AppData\Local\Temp\ipykernel_12100\1439998361.py:1: SyntaxWarning: invalid escape sequence '\s'
  re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

In [85]:
regex = re.compile('\s+')

<>:1: SyntaxWarning: invalid escape sequence '\s'
<>:1: SyntaxWarning: invalid escape sequence '\s'
C:\Users\anton.dmitriev\AppData\Local\Temp\ipykernel_12100\1890572334.py:1: SyntaxWarning: invalid escape sequence '\s'
  regex = re.compile('\s+')

In [86]:
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [87]:
regex.findall(text)

['      ', '\t ', ' \t']

In [88]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""

In [100]:
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}' #регулярка почты

In [93]:
regex = re.compile(pattern, flags=re.IGNORECASE)

In [94]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [95]:
m = regex.search(text)

In [96]:
m

In [98]:
print(regex.match(text))

None

In [99]:
print(regex.sub('REDACTED', text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [102]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'

In [103]:
regex = re.compile(pattern, flags=re.IGNORECASE)

In [104]:
m = regex.match('wesm@bright.net')

In [105]:
m.groups()

('wesm', 'bright', 'net')

In [106]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [107]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3', text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

In [108]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com',
        'Rob': 'rob@gmail.com', 'Wes': np.nan}

In [109]:
data = pd.Series(data)

In [110]:
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [111]:
data['Dave']

'dave@google.com'

In [112]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [113]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [114]:
pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [115]:
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [116]:
matches = data.str.match(pattern, flags=re.IGNORECASE)

In [117]:
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [119]:
matches.str.get('1')

AttributeError: Can only use .str accessor with string values!

In [122]:
matches.str[0]

AttributeError: Can only use .str accessor with string values!

In [123]:
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object

In [2]:
data = pd.Series(np.random.randn(9),
                 index=[['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd'],
                        [1, 2, 3, 1, 3, 1, 2, 2, 3]])

In [3]:
data

a  1   -0.357276
   2   -0.354243
   3   -0.632842
b  1   -0.266813
   3   -1.802448
c  1   -0.124513
   2    1.034136
d  2   -0.688988
   3    0.586639
dtype: float64

In [4]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

In [5]:
data['b']

1   -0.266813
3   -1.802448
dtype: float64

In [6]:
data['b':'c']

b  1   -0.266813
   3   -1.802448
c  1   -0.124513
   2    1.034136
dtype: float64

In [7]:
data.loc[['b', 'd']]

b  1   -0.266813
   3   -1.802448
d  2   -0.688988
   3    0.586639
dtype: float64

In [8]:
data.loc[:, 2]

a   -0.354243
c    1.034136
d   -0.688988
dtype: float64

In [9]:
data.unstack()

          1         2         3
a -0.357276 -0.354243 -0.632842
b -0.266813       NaN -1.802448
c -0.124513  1.034136       NaN
d       NaN -0.688988  0.586639

In [10]:
data.unstack().stack()

a  1   -0.357276
   2   -0.354243
   3   -0.632842
b  1   -0.266813
   3   -1.802448
c  1   -0.124513
   2    1.034136
d  2   -0.688988
   3    0.586639
dtype: float64

In [11]:
frame = pd.DataFrame(np.arange(12).reshape((4, 3)),
                     index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                     columns=[['Ohio', 'Ohio', 'Colorado'],
                              ['Green', 'Red', 'Green']])

In [12]:
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [13]:
frame.index.names = ['key1', 'key2']

In [14]:
frame.columns.names = ['state', 'color']

In [15]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [16]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [17]:
pd.MultiIndex.from_arrays([['Ohio', 'Ohio', 'Colorado'], ['Green', 'Red', 'Green']],
names=['state', 'color'])

MultiIndex([(    'Ohio', 'Green'),
            (    'Ohio',   'Red'),
            ('Colorado', 'Green')],
           names=['state', 'color'])

In [18]:
frame.swaplevel('key1', 'key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [21]:
frame.sort_index(level=1)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [22]:
frame.swaplevel(0, 1).sort_index(level=0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

In [31]:
frame.groupby(level='key2').sum()

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [38]:
frame.T.groupby(level='color').sum().T

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

In [40]:
frame = DataFrame({'a': range(7), 'b': range(7, 0, -1),
                   'c': ['one', 'one', 'one', 'two', 'two', 'two', 'two'],
                   'd': [0, 1, 2, 0, 1, 2, 3]})

In [41]:
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [42]:
frame2 = frame.set_index(['c', 'd'])

In [43]:
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [44]:
frame.set_index(['c', 'd'], drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [45]:
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

In [46]:
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
                    'data1': range(7)})

In [47]:
df2 = pd.DataFrame({'key': ['a', 'b', 'd'],
                    'data2': range(3)})

In [48]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [49]:
df2

  key  data2
0   a      0
1   b      1
2   d      2

In [50]:
pd.merge(df1, df2)

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [51]:
pd.merge(df1, df2, on='key')

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [52]:
df3 = pd.DataFrame({'lkey': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
                    'data1': range(7)})

In [53]:
df4 = pd.DataFrame({'rkey': ['a', 'b', 'd'],
                    'data2': range(3)})

In [54]:
pd.merge(df3, df4, left_on='lkey', right_on='rkey')

  lkey  data1 rkey  data2
0    b      0    b      1
1    b      1    b      1
2    b      6    b      1
3    a      2    a      0
4    a      4    a      0
5    a      5    a      0

In [55]:
pd.merge(df1, df2, how='outer')

  key  data1  data2
0   b    0.0    1.0
1   b    1.0    1.0
2   b    6.0    1.0
3   a    2.0    0.0
4   a    4.0    0.0
5   a    5.0    0.0
6   c    3.0    NaN
7   d    NaN    2.0

In [56]:
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                    'data1': range(6)})

In [57]:
df2 = pd.DataFrame({'key': ['a', 'b', 'a', 'b', 'd'],
                    'data2': range(5)})

In [58]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [59]:
df2

  key  data2
0   a      0
1   b      1
2   a      2
3   b      3
4   d      4

In [60]:
pd.merge(df1, df2, on='key', how='left')

   key  data1  data2
0    b      0    1.0
1    b      0    3.0
2    b      1    1.0
3    b      1    3.0
4    a      2    0.0
5    a      2    2.0
6    c      3    NaN
7    a      4    0.0
8    a      4    2.0
9    b      5    1.0
10   b      5    3.0

In [61]:
pd.merge(df1, df2, how='inner')

  key  data1  data2
0   b      0      1
1   b      0      3
2   b      1      1
3   b      1      3
4   b      5      1
5   b      5      3
6   a      2      0
7   a      2      2
8   a      4      0
9   a      4      2

In [62]:
left = pd.DataFrame({'key1': ['foo', 'foo', 'bar'],
                     'key2': ['one', 'two', 'one'],
                     'lval': [1, 2, 3]})

In [63]:
right = pd.DataFrame({'key1': ['foo', 'foo', 'bar', 'bar'],
                      'key2': ['one', 'one', 'one', 'two'],
                      'rval': [4, 5, 6, 7]})

In [65]:
left

  key1 key2  lval
0  foo  one     1
1  foo  two     2
2  bar  one     3

In [66]:
right

  key1 key2  rval
0  foo  one     4
1  foo  one     5
2  bar  one     6
3  bar  two     7

In [67]:
pd.merge(left, right, on=['key1', 'key2'], how='outer')

  key1 key2  lval  rval
0  foo  one   1.0   4.0
1  foo  one   1.0   5.0
2  foo  two   2.0   NaN
3  bar  one   3.0   6.0
4  bar  two   NaN   7.0

In [68]:
pd.merge(left, right, on='key1')

  key1 key2_x  lval key2_y  rval
0  foo    one     1    one     4
1  foo    one     1    one     5
2  foo    two     2    one     4
3  foo    two     2    one     5
4  bar    one     3    one     6
5  bar    one     3    two     7

In [69]:
pd.merge(left, right, on='key1', suffixes=('_left', '_right'))

  key1 key2_left  lval key2_right  rval
0  foo       one     1        one     4
1  foo       one     1        one     5
2  foo       two     2        one     4
3  foo       two     2        one     5
4  bar       one     3        one     6
5  bar       one     3        two     7

In [70]:
left1 = pd.DataFrame({'key': ['a', 'b', 'a', 'a', 'b', 'c'],
                      'value': range(6)})

In [71]:
right1 = pd.DataFrame({'group_val': [3.5, 7]}, index=['a', 'b'])

In [72]:
left1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [73]:
right1

   group_val
a        3.5
b        7.0

In [74]:
pd.merge(left1, right1, left_on='key', right_index=True)

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0

In [75]:
pd.merge(left1, right1, left_on='key', right_index=True, how='outer')

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0
5   c      5        NaN

In [76]:
lefth = pd.DataFrame({'key1': ['Ohio', 'Ohio', 'Ohio',
                               'Nevada', 'Nevada'],
                      'key2': [2000, 2001, 2002, 2001, 2002],
                      'data': np.arange(5.)})

In [77]:
righth = pd.DataFrame(np.arange(12).reshape((6, 2)),
                      index=[['Nevada', 'Nevada', 'Ohio', 'Ohio',
                              'Ohio', 'Ohio'],
                             [2001, 2000, 2000, 2000, 2001, 2002]],
                      columns=['event1', 'event2'])

In [78]:
lefth

     key1  key2  data
0    Ohio  2000   0.0
1    Ohio  2001   1.0
2    Ohio  2002   2.0
3  Nevada  2001   3.0
4  Nevada  2002   4.0

In [79]:
righth

             event1  event2
Nevada 2001       0       1
       2000       2       3
Ohio   2000       4       5
       2000       6       7
       2001       8       9
       2002      10      11

In [80]:
pd.merge(lefth, righth, left_on=['key1', 'key2'], right_index=True)

     key1  key2  data  event1  event2
0    Ohio  2000   0.0       4       5
0    Ohio  2000   0.0       6       7
1    Ohio  2001   1.0       8       9
2    Ohio  2002   2.0      10      11
3  Nevada  2001   3.0       0       1

In [81]:
pd.merge(lefth, righth, left_on=['key1', 'key2'],
         right_index=True, how='outer')

     key1  key2  data  event1  event2
0    Ohio  2000   0.0     4.0     5.0
0    Ohio  2000   0.0     6.0     7.0
1    Ohio  2001   1.0     8.0     9.0
2    Ohio  2002   2.0    10.0    11.0
3  Nevada  2001   3.0     0.0     1.0
4  Nevada  2002   4.0     NaN     NaN
4  Nevada  2000   NaN     2.0     3.0

In [82]:
left2 = pd.DataFrame([[1., 2.], [3., 4.], [5., 6.]],
                     index=['a', 'c', 'e'],
                     columns=['Ohio', 'Nevada'])

In [83]:
right2 = pd.DataFrame([[7., 8.], [9., 10.], [11., 12.], [13, 14]],
                      index=['b', 'c', 'd', 'e'],
                      columns=['Missouri', 'Alabama'])

In [84]:
left2

   Ohio  Nevada
a   1.0     2.0
c   3.0     4.0
e   5.0     6.0

In [85]:
right2

   Missouri  Alabama
b       7.0      8.0
c       9.0     10.0
d      11.0     12.0
e      13.0     14.0

In [86]:
pd.merge(left2, right2, how='outer', left_index=True, right_index=True)

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

In [87]:
left2.join(right2, how='outer')

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

In [88]:
left1.join(right1, on='key')

  key  value  group_val
0   a      0        3.5
1   b      1        7.0
2   a      2        3.5
3   a      3        3.5
4   b      4        7.0
5   c      5        NaN

In [89]:
another = pd.DataFrame([[7., 8.], [9., 10.], [11., 12.], [16., 17.]],
                       index=['a', 'c', 'e', 'f'],
                       columns=['New York', 'Oregon'])

In [90]:
another

   New York  Oregon
a       7.0     8.0
c       9.0    10.0
e      11.0    12.0
f      16.0    17.0

In [91]:
left2.join([right2, another])

   Ohio  Nevada  Missouri  Alabama  New York  Oregon
a   1.0     2.0       NaN      NaN       7.0     8.0
c   3.0     4.0       9.0     10.0       9.0    10.0
e   5.0     6.0      13.0     14.0      11.0    12.0

In [92]:
left2.join([right2, another], how='outer')

   Ohio  Nevada  Missouri  Alabama  New York  Oregon
a   1.0     2.0       NaN      NaN       7.0     8.0
c   3.0     4.0       9.0     10.0       9.0    10.0
e   5.0     6.0      13.0     14.0      11.0    12.0
b   NaN     NaN       7.0      8.0       NaN     NaN
d   NaN     NaN      11.0     12.0       NaN     NaN
f   NaN     NaN       NaN      NaN      16.0    17.0

In [93]:
arr = np.arange(12).reshape((3, 4))

In [94]:
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [95]:
np.concatenate([arr, arr], axis=1)

array([[ 0,  1,  2,  3,  0,  1,  2,  3],
       [ 4,  5,  6,  7,  4,  5,  6,  7],
       [ 8,  9, 10, 11,  8,  9, 10, 11]])

In [96]:
s1 = pd.Series([0, 1], index=['a', 'b'])

In [97]:
s2 = pd.Series([2, 3, 4], index=['c', 'd', 'e'])

In [98]:
s3 = pd.Series([5, 6], index=['f', 'g'])

In [99]:
pd.concat([s1, s2, s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [100]:
pd.concat([s1, s3, s2])

a    0
b    1
f    5
g    6
c    2
d    3
e    4
dtype: int64

In [101]:
pd.concat([s1, s2, s3], axis=1)

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

In [102]:
s4 = pd.concat([s1, s3])

In [104]:
s4

a    0
b    1
f    5
g    6
dtype: int64

In [105]:
pd.concat([s1, s4], axis=1)

     0  1
a  0.0  0
b  1.0  1
f  NaN  5
g  NaN  6

In [106]:
pd.concat([s1, s4], axis=1, join='inner')

   0  1
a  0  0
b  1  1

In [110]:
pd.concat([s1, s4], axis=1).reindex(['a','c','b','e'])

     0    1
a  0.0  0.0
c  NaN  NaN
b  1.0  1.0
e  NaN  NaN

In [111]:
result = pd.concat([s1, s1, s3], keys=['one', 'two', 'three'])

In [112]:
result

one    a    0
       b    1
two    a    0
       b    1
three  f    5
       g    6
dtype: int64

In [113]:
result.unstack()

         a    b    f    g
one    0.0  1.0  NaN  NaN
two    0.0  1.0  NaN  NaN
three  NaN  NaN  5.0  6.0

In [114]:
pd.concat([s1, s2, s3], axis=1, keys=['one', 'two', 'three'])

   one  two  three
a  0.0  NaN    NaN
b  1.0  NaN    NaN
c  NaN  2.0    NaN
d  NaN  3.0    NaN
e  NaN  4.0    NaN
f  NaN  NaN    5.0
g  NaN  NaN    6.0

In [115]:
df1 = pd.DataFrame(np.arange(6).reshape(3, 2), index=['a', 'b', 'c'],
                   columns=['one', 'two'])

In [116]:
df2 = pd.DataFrame(5 + np.arange(4).reshape(2, 2), index=['a', 'c'],
                   columns=['three', 'four'])

In [117]:
df1

   one  two
a    0    1
b    2    3
c    4    5

In [118]:
df2

   three  four
a      5     6
c      7     8

In [119]:
pd.concat([df1, df2], axis=1, keys=['level1', 'level2'])

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

In [120]:
pd.concat({'level1': df1, 'level2': df2}, axis=1)

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

In [121]:
pd.concat([df1, df2], axis=1, keys=['level1', 'level2'],
          names=['upper', 'lower'])

upper level1     level2
lower    one two  three four
a          0   1    5.0  6.0
b          2   3    NaN  NaN
c          4   5    7.0  8.0

In [122]:
pd.concat([df1, df2], axis=1, keys=['level1', 'level2'],
          names=['upper', 'lower'])

upper level1     level2
lower    one two  three four
a          0   1    5.0  6.0
b          2   3    NaN  NaN
c          4   5    7.0  8.0

In [123]:
df1 = pd.DataFrame(np.random.randn(3, 4), columns=['a', 'b', 'c', 'd'])

In [124]:
df2 = pd.DataFrame(np.random.randn(2, 3), columns=['b', 'd', 'a'])

In [125]:
df1

          a         b         c         d
0  2.046929  0.337351 -0.338394 -0.497377
1  0.499976 -2.206769  0.572259 -1.348677
2 -1.954731  0.915790  0.816399  1.193526

In [126]:
df2

          b         d         a
0 -0.121793 -0.100308 -0.253047
1  0.390624 -0.172186 -0.620339

In [127]:
pd.concat([df1, df2], ignore_index=True)

          a         b         c         d
0  2.046929  0.337351 -0.338394 -0.497377
1  0.499976 -2.206769  0.572259 -1.348677
2 -1.954731  0.915790  0.816399  1.193526
3 -0.253047 -0.121793       NaN -0.100308
4 -0.620339  0.390624       NaN -0.172186

In [3]:
a = pd.Series([np.nan, 2.5, np.nan, 3.5, 4.5, np.nan],
              index=['f', 'e', 'd', 'c', 'b', 'a'])

In [4]:
b = pd.Series(np.arange(len(a), dtype=np.float64),
              index=['f', 'e', 'd', 'c', 'b', 'a'])

In [5]:
b[-1] = np.nan

C:\Users\anton.dmitriev\AppData\Local\Temp\ipykernel_20180\1621735104.py:1: FutureWarning: Series.__setitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To set a value by position, use `ser.iloc[pos] = value`
  b[-1] = np.nan

In [6]:
a

f    NaN
e    2.5
d    NaN
c    3.5
b    4.5
a    NaN
dtype: float64

In [7]:
b

f    0.0
e    1.0
d    2.0
c    3.0
b    4.0
a    NaN
dtype: float64

In [8]:
np.where(pd.isnull(a), b, a)

array([0. , 2.5, 2. , 3.5, 4.5, nan])

In [10]:
b[:-2].combine_first(a[2:])

a    NaN
b    4.5
c    3.0
d    2.0
e    1.0
f    0.0
dtype: float64

In [11]:
df1 = pd.DataFrame({'a': [1., np.nan, 5., np.nan],
                    'b': [np.nan, 2., np.nan, 6.],
                    'c': range(2, 18, 4)})

In [12]:
df2 = pd.DataFrame({'a': [5., 4., np.nan, 3., 7.],
                    'b': [np.nan, 3., 4., 6., 8.]})

In [13]:
df1

     a    b   c
0  1.0  NaN   2
1  NaN  2.0   6
2  5.0  NaN  10
3  NaN  6.0  14

In [14]:
df2

     a    b
0  5.0  NaN
1  4.0  3.0
2  NaN  4.0
3  3.0  6.0
4  7.0  8.0

In [15]:
df1.combine_first(df2)

     a    b     c
0  1.0  NaN   2.0
1  4.0  2.0   6.0
2  5.0  4.0  10.0
3  3.0  6.0  14.0
4  7.0  8.0   NaN

In [16]:
data = pd.DataFrame(np.arange(6).reshape((2, 3)),
                    index=pd.Index(['Ohio', 'Colorado'], name='state'),
                    columns=pd.Index(['one', 'two', 'three'], name='number'))

In [17]:
data

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [18]:
result = data.stack()

In [19]:
result

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int32

In [20]:
result.unstack()

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [21]:
result.unstack(0)

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [22]:
result.unstack('state')

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [23]:
s1 = pd.Series([0, 1, 2, 3], index=['a', 'b', 'c', 'd'])

In [24]:
s2 = pd.Series([4, 5, 6], index=['c', 'd', 'e'])

In [25]:
data2 = pd.concat([s1, s2], keys=['one', 'two'])

In [26]:
data2

one  a    0
     b    1
     c    2
     d    3
two  c    4
     d    5
     e    6
dtype: int64

In [27]:
data2.unstack()

       a    b    c    d    e
one  0.0  1.0  2.0  3.0  NaN
two  NaN  NaN  4.0  5.0  6.0

In [28]:
data2.unstack().stack()

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
two  c    4.0
     d    5.0
     e    6.0
dtype: float64

In [29]:
data2.unstack().stack(dropna=False)

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
     e    NaN
two  a    NaN
     b    NaN
     c    4.0
     d    5.0
     e    6.0
dtype: float64

In [30]:
df = pd.DataFrame({'left': result, 'right': result + 5},
                  columns=pd.Index(['left', 'right'], name='side'))

In [31]:
df

side             left  right
state    number
Ohio     one        0      5
         two        1      6
         three      2      7
Colorado one        3      8
         two        4      9
         three      5     10

In [32]:
df.unstack('state')

side   left          right
state  Ohio Colorado  Ohio Colorado
number
one       0        3     5        8
two       1        4     6        9
three     2        5     7       10

In [33]:
df.unstack('state').stack('side')

state         Ohio  Colorado
number side
one    left      0         3
       right     5         8
two    left      1         4
       right     6         9
three  left      2         5
       right     7        10

In [34]:
data = pd.read_csv('examples/macrodata.csv')

In [35]:
data.head()

,year,quarter,realgdp,realcons,realinv,realgovt,realdpi,cpi,m1,tbilrate,unemp,pop,infl,realint
0,1959,1,2710.349,1707.4,286.898,470.045,1886.9,28.98,139.7,2.82,5.8,177.146,0.00,0.00
1,1959,2,2778.801,1733.7,310.859,481.301,1919.7,29.15,141.7,3.08,5.1,177.830,2.34,0.74
2,1959,3,2775.488,1751.8,289.226,491.260,1916.4,29.35,140.5,3.82,5.3,178.657,2.74,1.09
3,1959,4,2785.204,1753.7,299.356,484.052,1931.3,29.37,140.0,4.33,5.6,179.386,0.27,4.06
4,1960,1,2847.699,1770.5,331.722,462.199,1955.5,29.54,139.6,3.50,5.2,180.007,2.31,1.19

In [36]:
periods = pd.PeriodIndex(year=data.year, quarter=data.quarter,
                         name='date')

In [37]:
columns = pd.Index(['realgdp', 'infl', 'unemp'], name='item')

In [38]:
data = data.reindex(columns=columns)

In [39]:
data.index = periods.to_timestamp('D', 'end')

In [40]:
ldata = data.stack().reset_index().rename(columns={0: 'value'})

In [44]:
ldata[:10]

                           date     item     value
0 1959-03-31 23:59:59.999999999  realgdp  2710.349
1 1959-03-31 23:59:59.999999999     infl     0.000
2 1959-03-31 23:59:59.999999999    unemp     5.800
3 1959-06-30 23:59:59.999999999  realgdp  2778.801
4 1959-06-30 23:59:59.999999999     infl     2.340
5 1959-06-30 23:59:59.999999999    unemp     5.100
6 1959-09-30 23:59:59.999999999  realgdp  2775.488
7 1959-09-30 23:59:59.999999999     infl     2.740
8 1959-09-30 23:59:59.999999999    unemp     5.300
9 1959-12-31 23:59:59.999999999  realgdp  2785.204

In [46]:
pivoted = ldata.pivot(index='date', columns='item', values='value')

In [47]:
pivoted

item                           infl    realgdp  unemp
date
1959-03-31 23:59:59.999999999  0.00   2710.349    5.8
1959-06-30 23:59:59.999999999  2.34   2778.801    5.1
1959-09-30 23:59:59.999999999  2.74   2775.488    5.3
1959-12-31 23:59:59.999999999  0.27   2785.204    5.6
1960-03-31 23:59:59.999999999  2.31   2847.699    5.2
...                             ...        ...    ...
2008-09-30 23:59:59.999999999 -3.16  13324.600    6.0
2008-12-31 23:59:59.999999999 -8.79  13141.920    6.9
2009-03-31 23:59:59.999999999  0.94  12925.410    8.1
2009-06-30 23:59:59.999999999  3.37  12901.504    9.2
2009-09-30 23:59:59.999999999  3.56  12990.341    9.6

[203 rows x 3 columns]

In [48]:
ldata['value2'] = np.random.randn(len(ldata))

In [49]:
ldata

                             date     item      value    value2
0   1959-03-31 23:59:59.999999999  realgdp   2710.349  0.516561
1   1959-03-31 23:59:59.999999999     infl      0.000 -0.861798
2   1959-03-31 23:59:59.999999999    unemp      5.800  0.998675
3   1959-06-30 23:59:59.999999999  realgdp   2778.801  0.933060
4   1959-06-30 23:59:59.999999999     infl      2.340  1.995843
..                            ...      ...        ...       ...
604 2009-06-30 23:59:59.999999999     infl      3.370 -0.195588
605 2009-06-30 23:59:59.999999999    unemp      9.200  0.324906
606 2009-09-30 23:59:59.999999999  realgdp  12990.341  1.155913
607 2009-09-30 23:59:59.999999999     infl      3.560 -0.292649
608 2009-09-30 23:59:59.999999999    unemp      9.600  0.890023

[609 rows x 4 columns]

In [50]:
ldata[:10]

                           date     item     value    value2
0 1959-03-31 23:59:59.999999999  realgdp  2710.349  0.516561
1 1959-03-31 23:59:59.999999999     infl     0.000 -0.861798
2 1959-03-31 23:59:59.999999999    unemp     5.800  0.998675
3 1959-06-30 23:59:59.999999999  realgdp  2778.801  0.933060
4 1959-06-30 23:59:59.999999999     infl     2.340  1.995843
5 1959-06-30 23:59:59.999999999    unemp     5.100  0.019063
6 1959-09-30 23:59:59.999999999  realgdp  2775.488  0.533760
7 1959-09-30 23:59:59.999999999     infl     2.740  1.292417
8 1959-09-30 23:59:59.999999999    unemp     5.300 -0.429242
9 1959-12-31 23:59:59.999999999  realgdp  2785.204  1.409336

In [51]:
pivoted = ldata.pivot(index='date', columns='item')

In [53]:
pivoted[:10]

                              value                    value2            \
item                           infl   realgdp unemp      infl   realgdp
date
1959-03-31 23:59:59.999999999  0.00  2710.349   5.8 -0.861798  0.516561
1959-06-30 23:59:59.999999999  2.34  2778.801   5.1  1.995843  0.933060
1959-09-30 23:59:59.999999999  2.74  2775.488   5.3  1.292417  0.533760
1959-12-31 23:59:59.999999999  0.27  2785.204   5.6  0.154992  1.409336
1960-03-31 23:59:59.999999999  2.31  2847.699   5.2  1.796468  0.276376
1960-06-30 23:59:59.999999999  0.14  2834.390   5.2 -0.366067 -0.642843
1960-09-30 23:59:59.999999999  2.70  2839.022   5.6 -0.134696  1.711122
1960-12-31 23:59:59.999999999  1.21  2802.616   6.3  1.517792 -0.225135
1961-03-31 23:59:59.999999999 -0.40  2819.264   6.8 -0.238169 -0.831142
1961-06-30 23:59:59.999999999  1.47  2872.005   7.0 -0.778975  1.102862


item                              unemp
date
1959-03-31 23:59:59.999999999  0.998675
1959-06-30 23:59:59.999999999  0.019063
1959-09-30 23:59:59.999999999 -0.429242
1959-12-31 23:59:59.999999999  0.230280
1960-03-31 23:59:59.999999999 -1.267642
1960-06-30 23:59:59.999999999  0.678156
1960-09-30 23:59:59.999999999 -1.332050
1960-12-31 23:59:59.999999999  0.819722
1961-03-31 23:59:59.999999999  0.825463
1961-06-30 23:59:59.999999999 -0.416783

In [54]:
pivoted['value'][:5]

item                           infl   realgdp  unemp
date
1959-03-31 23:59:59.999999999  0.00  2710.349    5.8
1959-06-30 23:59:59.999999999  2.34  2778.801    5.1
1959-09-30 23:59:59.999999999  2.74  2775.488    5.3
1959-12-31 23:59:59.999999999  0.27  2785.204    5.6
1960-03-31 23:59:59.999999999  2.31  2847.699    5.2

In [55]:
unstacked = ldata.set_index(['date', 'item']).unstack('item')

In [56]:
unstacked[:7]

                              value                    value2            \
item                           infl   realgdp unemp      infl   realgdp
date
1959-03-31 23:59:59.999999999  0.00  2710.349   5.8 -0.861798  0.516561
1959-06-30 23:59:59.999999999  2.34  2778.801   5.1  1.995843  0.933060
1959-09-30 23:59:59.999999999  2.74  2775.488   5.3  1.292417  0.533760
1959-12-31 23:59:59.999999999  0.27  2785.204   5.6  0.154992  1.409336
1960-03-31 23:59:59.999999999  2.31  2847.699   5.2  1.796468  0.276376
1960-06-30 23:59:59.999999999  0.14  2834.390   5.2 -0.366067 -0.642843
1960-09-30 23:59:59.999999999  2.70  2839.022   5.6 -0.134696  1.711122


item                              unemp
date
1959-03-31 23:59:59.999999999  0.998675
1959-06-30 23:59:59.999999999  0.019063
1959-09-30 23:59:59.999999999 -0.429242
1959-12-31 23:59:59.999999999  0.230280
1960-03-31 23:59:59.999999999 -1.267642
1960-06-30 23:59:59.999999999  0.678156
1960-09-30 23:59:59.999999999 -1.332050

In [57]:
df = pd.DataFrame({'key': ['foo', 'bar', 'baz'],
                   'A': [1, 2, 3],
                   'B': [4, 5, 6],
                   'C': [7, 8, 9]})

In [58]:
df

   key  A  B  C
0  foo  1  4  7
1  bar  2  5  8
2  baz  3  6  9

In [59]:
melted = pd.melt(df, ['key'])

In [60]:
melted

   key variable  value
0  foo        A      1
1  bar        A      2
2  baz        A      3
3  foo        B      4
4  bar        B      5
5  baz        B      6
6  foo        C      7
7  bar        C      8
8  baz        C      9

In [63]:
reshaped = melted.pivot(index='key', columns='variable', values='value')

In [64]:
reshaped

variable  A  B  C
key
bar       2  5  8
baz       3  6  9
foo       1  4  7

In [65]:
reshaped.reset_index()

variable  key  A  B  C
0         bar  2  5  8
1         baz  3  6  9
2         foo  1  4  7

In [66]:
pd.melt(df, id_vars=['key'], value_vars=['A', 'B'])

   key variable  value
0  foo        A      1
1  bar        A      2
2  baz        A      3
3  foo        B      4
4  bar        B      5
5  baz        B      6

In [67]:
pd.melt(df, value_vars=['A', 'B', 'C'])

  variable  value
0        A      1
1        A      2
2        A      3
3        B      4
4        B      5
5        B      6
6        C      7
7        C      8
8        C      9

In [68]:
pd.melt(df, value_vars=['key', 'A', 'B'])

  variable value
0      key   foo
1      key   bar
2      key   baz
3        A     1
4        A     2
5        A     3
6        B     4
7        B     5
8        B     6